<html>
  <head>
    <title>異世界?r3:0挑戰</title>
    <meta charset='utf-8' />
    <link rel='stylesheet' href='css/index.css' />
    <link href="https://fonts.googleapis.com/css?family=Noto+Serif+TC|Overpass+Mono&display=swap" rel="stylesheet">
  </head>
  <body>
    <pre>
        --------------------------------------------------------------------------------------
                 ____    __     ____ _   _    _    _     _     _____ _   _  ____ _____ 
             _ _|___ / / _ \ _ / ___| | | |  / \  | |   | |   | ____| \ | |/ ___| ____|
            | '__||_ \| | | (_) |   | |_| | / _ \ | |   | |   |  _| |  \| | |  _|  _|  
            | |  ___) | |_| |_| |___|  _  |/ ___ \| |___| |___| |___| |\  | |_| | |___ 
            |_| |____/ \___/(_)\____|_| |_/_/   \_\_____|_____|_____|_| \_|\____|_____|

                這裡一共有 10 道關卡，每一關的網址皆為 /lvX.php，X 即為關卡的數字。
                但只知道網址是沒有用的，需要搭配正確的 token 才能順利進入關卡，
                傳入 token 的方式為 query string，例如 /lv1?token=xxx。
              
                另外，為了讓你方便辨別這是 token，token 除了少數的題目，大部分會用 {} 括號起來，
                去掉大括號後，大括號內的就是正確的 token，且 token 只會是小寫英文字母、數字、
                與符號的組合。
                
                每一關都會有系統提示，只要按照提示照著做，就能拿到前往下一關的 token。
              
                準備好了嗎？ 
        ---------------------------------------------------------------------------------------
    </pre>
    <a href='lv0.php'> 開始遊戲 </a>
  </body>
</html>
